#Область ПрограмныйИнтерфейс
	
// Пересчитать табличные части.
// 
// Параметры:
//  Заказ - ДокументСсылка - Заказ
//  СписокТЧ - Строка - Список ТЧ
Процедура ПересчитатьТабличныеЧасти(Заказ, СписокТЧ) Экспорт
        
    Для каждого ТЧИмя Из СписокТЧ Цикл
    
        Для каждого Строка Из Заказ[ТЧИмя.Значение] Цикл   
            
            ПересчитатьСуммуСтрокиСУчетомСкидки(Строка, Заказ.ОЛ_СогласованнаяСкидка);	    
            
        КонецЦикла; 	
    
    КонецЦикла;
    	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПересчитатьСуммуСтрокиСУчетомСкидки(СтрокаТабличнойЧасти, СкидкаПроцентом)
    
    СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество * (100 - СкидкаПроцентом)/100;
    
КонецПроцедуры

#КонецОбласти